--- Day 1: The Tyranny of the Rocket Equation ---
Santa has become stranded at the edge of the Solar System while delivering presents to other planets! To accurately calculate his position in space, safely align his warp drive, and return to Earth in time to save Christmas, he needs you to bring him measurements from fifty stars.

Collect stars by solving puzzles. Two puzzles will be made available on each day in the Advent calendar; the second puzzle is unlocked when you complete the first. Each puzzle grants one star. Good luck!

The Elves quickly load you into a spacecraft and prepare to launch.

At the first Go / No Go poll, every Elf is Go until the Fuel Counter-Upper. They haven't determined the amount of fuel required yet.

Fuel required to launch a given module is based on its mass. Specifically, to find the fuel required for a module, take its mass, divide by three, round down, and subtract 2.

For example:

For a mass of 12, divide by 3 and round down to get 4, then subtract 2 to get 2.
For a mass of 14, dividing by 3 and rounding down still yields 4, so the fuel required is also 2.
For a mass of 1969, the fuel required is 654.
For a mass of 100756, the fuel required is 33583.
The Fuel Counter-Upper needs to know the total fuel requirement. To find it, individually calculate the fuel needed for the mass of each module (your puzzle input), then add together all the fuel values.

* Prelude

To start, let's load the input.

#+begin_src clojure :tangle yes
(ns advent-2019.day1)

(require '[clojure.java.io :as io])

(require '[clojure.string :as string])

(def input (-> (io/resource "day1.input")
               (slurp)
               (string/split #"\n")
               (->> (map #(Integer/parseInt %)))))
#+end_src

#+RESULTS:
: nilnilnilnil#'advent-2019.day1/input


We also can encode the mass calculation: take the mass, divide by 3, round down,
minus 2

#+begin_src clojure :ns advent-2019.day1 :tangle yes
(defn fuel [mass] 
  (-> mass (/ 3) (Math/floor) (- 2) (int)))
#+end_src

#+RESULTS:
: nil#'advent-2019.day1/fuel


* Part 1

What is the sum of the fuel requirements for all of the modules on your spacecraft?

#+begin_src clojure :results output :ns advent-2019.day1
(def part1 (transduce (map fuel) + input))

(println part1)
#+end_src

#+RESULTS:
: 3397667


* Part 2

During the second Go / No Go poll, the Elf in charge of the Rocket Equation
Double-Checker stops the launch sequence. Apparently, you forgot to include
additional fuel for the fuel you just added.

Fuel itself requires fuel just like a module - take its mass, divide by three,
round down, and subtract 2. However, that fuel also requires fuel, and that fuel
requires fuel, and so on. Any mass that would require negative fuel should
instead be treated as if it requires zero fuel; the remaining mass, if any, is
instead handled by wishing really hard, which has no mass and is outside the
scope of this calculation.

So, for each module mass, calculate its fuel and add it to the total. Then,
treat the fuel amount you just calculated as the input mass and repeat the
process, continuing until a fuel requirement is zero or negative. For example:

A module of mass 14 requires 2 fuel. This fuel requires no further fuel (2
divided by 3 and rounded down is 0, which would call for a negative fuel), so
the total fuel required is still just 2.

At first, a module of mass 1969 requires 654 fuel. Then, this fuel requires 216
more fuel (654 / 3 - 2). 216 then requires 70 more fuel, which requires 21 fuel,
which requires 5 fuel, which requires no further fuel. So, the total fuel
required for a module of mass 1969 is 654 + 216 + 70 + 21 + 5 = 966.

The fuel required by a module of mass 100756 and its fuel is:
33583 + 11192 +3728 + 1240 + 411 + 135 + 43 + 12 + 2 = 50346.

What is the sum of the fuel requirements for all of the modules on your
spacecraft when also taking into account the mass of the added fuel? (Calculate
the fuel requirements for each module separately, then add them all up at the
end.)


---

Let's just try the naive version:

#+begin_src clojure :ns advent-2019.day1
(defn fuel2 
  ([mass]
   (fuel2 (fuel mass) 0))
  ([mass sum]
   (if (<= mass 0)
     sum
     (recur (fuel mass)
            (+ sum mass)))))

(assert (= (fuel2 1969) 966))

(assert (= (fuel2 100756) 50346))

#+end_src

#+RESULTS:
: nil#'advent-2019.day1/fuel2nilnil

Seems fast enough on the test input. Let's do it!

#+begin_src clojure :results output :ns advent-2019.day1
(def part2 (transduce (map fuel2) + input))

(println part2)
#+end_src

#+RESULTS:
: 5093620
